/****************************************Copyright (c)****************************************************
**
**                                 http://www.powermcu.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               RTC_Time.h
** Descriptions:            None
**
**--------------------------------------------------------------------------------------------------------
** Created by:              AVRman
** Created date:            2010-10-30
** Version:                 v1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/

#ifndef _RTC_TIME_H_
#define _RTC_TIME_H_

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include <time.h>
#include <stdio.h>
#include <string.h>


typedef struct
{
    uint16_t year;
    uint8_t month;
    uint8_t  day;
    uint8_t  hour;
    uint8_t  min;
    uint8_t  sec;
} time_type;

/* Private function prototypes -----------------------------------------------*/
void RTC_Init(void);
void Time_Display(void);
void Time_Regulate(void);

/***********************************************/
/* 函数名称: Save_state_and_setting                 */
/* 功能描述: 存储数据                         */
/* 输  　入: No                                */
/* 输  　出: No                                */
/* 全局变量: 无                                */
/* 调用模块: 无                                */
/* 修改时间：14年11月1日                      */
/***********************************************/
//extern void Save_state_and_setting(void):

/* Private variables ---------------------------------------------------------*/
extern FunctionalState TimeDisplay;
extern  void RTC_Configuration(void);
extern u8 RTC_Get(void);

/***********************************************/
/* 函数名称: Read_state_and_setting                 */
/* 功能描述: 存储数据                         */
/* 输  　入: No                                */
/* 输  　出: No                                */
/* 全局变量: 无                                */
/* 调用模块: 无                                */
/* 修改时间：14年11月18日                      */
/***********************************************/
extern void Read_state_and_setting(void);
/***********************************************/
/* 函数名称: Save_to_bkp                       */
/* 功能描述: 将信息存储于备份寄存器            */
/* 输  　入: No                                */
/* 输  　出: No                                */
/* 全局变量: 无                                */
/* 调用模块: 无                                */
/* 修改时间：15年10月9日                       */
/***********************************************/
extern void Save_to_bkp(void );
/***********************************************/
/* 函数名称: Save_to_bkp                       */
/* 功能描述: 将信息从备份寄存器中读出          */
/* 输  　入: No                                */
/* 输  　出: No                                */
/* 全局变量: 无                                */
/* 调用模块: 无                                */
/* 修改时间：15年10月9日                       */
/***********************************************/
extern void Read_from_bkp(void );
/***********************************************/
/* 函数名称: LED_flash                   */
/* 功能描述: 指示灯闪烁                         */
/* 输  　入: No                                */
/* 输  　出: No                                */
/* 全局变量: 无                                */
/* 调用模块: 无                                */
/* 修改时间：14年11月18日                      */
/***********************************************/
extern void LED_flash(void);
/***********************************************/
/* 函数名称: Pump_cunt_time                   */
/* 功能描述: 蠕动泵开始计时                        */
/* 输  　入: No                                */
/* 输  　出: No                                */
/* 全局变量: 无                                */
/* 调用模块: 无                                */
/* 修改时间：14年11月18日                      */
/***********************************************/
extern void Pump_cunt_time(void);
/***********************************************/
/* 函数名称: time_type Time_change(uint32 timer_cont)                   */
/* 功能描述: 获取时间函数                        */
/* 输  　入: No                                */
/* 输  　出: time_type                                */
/* 全局变量: 无                                */
/* 调用模块: 无                                */
/* 修改时间：15年7月1 日                      */
/***********************************************/
time_type Time_change(u32 timer_cont);





#endif

/*********************************************************************************************************
      END FILE
*********************************************************************************************************/
