/*************** Radio File (c) ***************/
/**                                          **/
/**      基于STM32开发的血液回收机           **/
/**        Email:287285415@qq.com            **/
/**                                          **/
/**--------------文件信息--------------------**/
/**文    件   名: User_dispaly.c              **/
/**创    建   人: 张峰                       **/
/**创  建  日 期: 2014年7月11日              **/
/**描         述: 界面显示函数               **/
/**                                          **/
/**********************************************/

#include "Flow_control.h"
#include "..\User\user_conf.h"



void Cell_saver_contorl(void)
{


}



